# 货币转换
#描述
#编写一个美元与人民币转换的程序，用户输入金额和汇率，美元用符号’$’表示，人民币用’￥’表示。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬
#输入格式

#第一行输入一个带货币符号的正数，数值作为金额，货币符号表明货币种类
#第二行输入一个正数作为汇率
#输出格式

#一个带货币符号的数值（保留2位小数）或Data error!

money = input("")
rate = eval(input(''))
if money[-1] in ['￥']:
    s = eval(money[0:-1]) / rate
    print("{:.2f}$".format(s))
elif money[-1] in ['$']:
    R = rate * eval(money[0:-1])
    print("{:.2f}￥".format(R))
else:
    print("Data error!")